src/DataProcessors/КИИ_ДашбордОшибок/КИИ_ДашбордОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КИИ_ДашбордОшибок</name>
</mdclass:DataProcessor>

src/InformationRegisters/КИИ_МониторингОшибокСтатистика/КИИ_МониторингОшибокСтатистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокСтатистика</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КИИ_МониторингОшибокЖурнал/КИИ_МониторингОшибокЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокЖурнал</name>
  <resources>
    <name>ПерваяДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееВхождение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтправок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичность</name>
    <type>
      <types>EnumRef.КИИ_УровниКритичности</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроанализированаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаАнализаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленаВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Игнорировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОтИИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КИИ_УровниКритичности/КИИ_УровниКритичности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_УровниКритичности</name>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Критическая</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/КИИ_ДашбордОшибок/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// SPDX-License-Identifier: MIT
// Copyright (c) 2026 Андриянов Роман (Androman.pro)
// https://opensource.org/license/mit
////////////////////////////////////////////////////////////////////////////////
// Дашборд "ошибки/день по критичности" поверх star-схемы мониторинга.
// Критичность НЕ хранится в Статистике (протухала бы после ре-анализа) - берется
// живой из регистра Журнал джойном по ХешОшибки (аудит P2 #2, единый источник).
// Под барами - раскрываемые списки ошибок дня с рекомендациями ИИ (ОписаниеОтИИ).
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Строит HTML-дашборд "ошибки/день по критичности" за период.
//
// Параметры:
//  ДатаНачала - Дата - начало периода (включительно, по дню возникновения).
//  ДатаОкончания - Дата - конец периода (включительно).
//
// Возвращаемое значение:
//  Строка - HTML-документ для HTML-поля формы.
Функция ПостроитьHTMLДашборда(Знач ДатаНачала, Знач ДатаОкончания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статистика.Период КАК Период,
	|	Журнал.Критичность КАК Критичность,
	|	СУММА(Статистика.Количество) КАК Количество
	|ИЗ
	|	РегистрСведений.КИИ_МониторингОшибокСтатистика КАК Статистика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КИИ_МониторингОшибокЖурнал КАК Журнал
	|		ПО Статистика.ХешОшибки = Журнал.ХешОшибки
	|ГДЕ
	|	Статистика.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	Статистика.Период,
	|	Журнал.Критичность
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));

	ДанныеПоДням = СвернутьВыборкуВДни(Запрос.Выполнить().Выбрать());
	ДобавитьОшибкиДней(ДанныеПоДням, НачалоДня(ДатаНачала), КонецДня(ДатаОкончания));
	Возврат СобратьHTMLИзДанных(ДанныеПоДням);

КонецФункции

// Собирает HTML дашборда из агрегата: стековые бары по дням и, при наличии,
// раскрываемые списки ошибок дня. Чистая функция (без обращения к БД).
//
// Параметры:
//  ДанныеПоДням - Массив из Структура - по одному элементу на день:
//   * Период - Дата - день возникновения.
//   * Всего - Число - всего ошибок за день.
//   * Уровни - Соответствие из КлючИЗначение - имя уровня критичности (Строка) -> количество (Число).
//   * Ошибки - Массив из Структура - ошибки дня по убыванию количества (опционально):
//      ** ИмяУровня - Строка - представление уровня критичности.
//      ** Событие - Строка - имя события журнала регистрации.
//      ** Количество - Число - вхождений за день.
//      ** ТекстОшибки - Строка - усеченный текст ошибки.
//      ** ОписаниеОтИИ - Строка - рекомендация ИИ-анализа (может быть пустой).
//   * ЕщеОшибок - Число - сколько ошибок дня не вошло в список (опционально).
//
// Возвращаемое значение:
//  Строка - HTML-документ.
Функция СобратьHTMLИзДанных(Знач ДанныеПоДням) Экспорт

	Порядок = ПорядокУровней();

	СтрокиHTML = "";
	Для Каждого ДеньДанные Из ДанныеПоДням Цикл

		СегментыHTML = "";
		Для Каждого ИмяУровня Из Порядок Цикл
			КоличествоУровня = ДеньДанные.Уровни.Получить(ИмяУровня);
			Если КоличествоУровня = Неопределено Или КоличествоУровня = 0 Тогда
				Продолжить;
			КонецЕсли;
			Ширина = ?(ДеньДанные.Всего > 0, Цел(КоличествоУровня * 100 / ДеньДанные.Всего), 0);
			СегментыHTML = СегментыHTML + СтрШаблон(
				"<div class='seg' style='width:%1%%; background:%2' title='%3: %4'></div>",
				Формат(Ширина, "ЧГ=0"),
				ЦветУровня(ИмяУровня),
				ИмяУровня,
				Формат(КоличествоУровня, "ЧГ=0"));
		КонецЦикла;

		СтрокиHTML = СтрокиHTML + СтрШаблон(
			"<div class='row'><div class='day'>%1</div><div class='bar'>%2</div><div class='total'>%3</div></div>",
			Формат(ДеньДанные.Период, "ДФ=yyyy-MM-dd"),
			СегментыHTML,
			Формат(ДеньДанные.Всего, "ЧГ=0"));

	КонецЦикла;

	Если ПустаяСтрока(СтрокиHTML) Тогда
		СтрокиHTML = "<div class='empty'>Нет данных за выбранный период.</div>";
	КонецЕсли;

	Возврат СтрШаблон(ШаблонСтраницы(), ЛегендаHTML(), СтрокиHTML, СекцияОшибокHTML(ДанныеПоДням));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дозаполняет дни списками ошибок из star-схемы: Статистика дает дневные
// количества по хешу, Журнал - живую критичность, тексты и рекомендации ИИ.
Процедура ДобавитьОшибкиДней(ДанныеПоДням, Знач ДатаНачала, Знач ДатаОкончания)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статистика.Период КАК Период,
	|	Статистика.Количество КАК Количество,
	|	Журнал.Критичность КАК Критичность,
	|	Журнал.Событие КАК Событие,
	|	Журнал.ТекстОшибки КАК ТекстОшибки,
	|	Журнал.ОписаниеОтИИ КАК ОписаниеОтИИ
	|ИЗ
	|	РегистрСведений.КИИ_МониторингОшибокСтатистика КАК Статистика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КИИ_МониторингОшибокЖурнал КАК Журнал
	|		ПО Статистика.ХешОшибки = Журнал.ХешОшибки
	|ГДЕ
	|	Статистика.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|УПОРЯДОЧИТЬ ПО
	|	Статистика.Период,
	|	Статистика.Количество УБЫВ";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	ОшибкиПоДням = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокДня = ОшибкиПоДням.Получить(Выборка.Период);
		Если СписокДня = Неопределено Тогда
			СписокДня = Новый Массив;
			ОшибкиПоДням.Вставить(Выборка.Период, СписокДня);
		КонецЕсли;

		ЗаписьОшибки = Новый Структура;
		ЗаписьОшибки.Вставить("ИмяУровня", ИмяУровняКритичности(Выборка.Критичность));
		ЗаписьОшибки.Вставить("Событие", Строка(Выборка.Событие));
		ЗаписьОшибки.Вставить("Количество", Выборка.Количество);
		ЗаписьОшибки.Вставить("ТекстОшибки", СократитьТекст(Выборка.ТекстОшибки, 300));
		ЗаписьОшибки.Вставить("ОписаниеОтИИ", СократитьТекст(Выборка.ОписаниеОтИИ, 1500));
		СписокДня.Добавить(ЗаписьОшибки);
	КонецЦикла;

	Лимит = ЛимитОшибокДня();
	Для Каждого ДеньДанные Из ДанныеПоДням Цикл
		СписокДня = ОшибкиПоДням.Получить(ДеньДанные.Период);
		Если СписокДня = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЕщеОшибок = 0;
		Если СписокДня.Количество() > Лимит Тогда
			ЕщеОшибок = СписокДня.Количество() - Лимит;
			Обрезанный = Новый Массив;
			Для Индекс = 0 По Лимит - 1 Цикл
				Обрезанный.Добавить(СписокДня[Индекс]);
			КонецЦикла;
			СписокДня = Обрезанный;
		КонецЕсли;

		ДеньДанные.Вставить("Ошибки", СписокДня);
		ДеньДанные.Вставить("ЕщеОшибок", ЕщеОшибок);
	КонецЦикла;

КонецПроцедуры

// Секция раскрываемых списков ошибок по дням; пустая строка, если ни у одного
// дня нет списка (обратная совместимость со старым контрактом без ключа Ошибки).
Функция СекцияОшибокHTML(Знач ДанныеПоДням)

	Блоки = "";
	Для Каждого ДеньДанные Из ДанныеПоДням Цикл
		Если Не ДеньДанные.Свойство("Ошибки") Или ДеньДанные.Ошибки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		Карточки = "";
		Для Каждого ЗаписьОшибки Из ДеньДанные.Ошибки Цикл
			СоветHTML = "";
			Если ЗначениеЗаполнено(ЗаписьОшибки.ОписаниеОтИИ) Тогда
				СоветHTML = СтрШаблон(
					"<details class='ai'><summary>Совет ИИ</summary><div class='aitext'>%1</div></details>",
					ЭкранироватьСПереносами(ЗаписьОшибки.ОписаниеОтИИ));
			КонецЕсли;
			ЦветЧипа = ЦветУровня(ЗаписьОшибки.ИмяУровня);
			СобытиеHTML = Экранировать(ЗаписьОшибки.Событие);
			КоличествоСтрокой = Формат(ЗаписьОшибки.Количество, "ЧГ=0");
			ТекстОшибкиHTML = ЭкранироватьСПереносами(ЗаписьОшибки.ТекстОшибки);
			Карточки = Карточки + СтрШаблон(
				"<div class='err'>"
					+ "<div class='errhead'>"
						+ "<span class='chip' style='background:%1'></span><b>%2</b>"
						+ "<span class='errcount'>%3 за день</span>"
					+ "</div>"
					+ "<div class='errtext'>%4</div>%5"
				+ "</div>",
				ЦветЧипа, СобытиеHTML, КоличествоСтрокой, ТекстОшибкиHTML, СоветHTML);
		КонецЦикла;

		Если ДеньДанные.Свойство("ЕщеОшибок") И ДеньДанные.ЕщеОшибок > 0 Тогда
			Карточки = Карточки + СтрШаблон(
				"<div class='more'>+%1 - полный список в регистре ""Журнал ошибок мониторинга""</div>",
				Формат(ДеньДанные.ЕщеОшибок, "ЧГ=0"));
		КонецЕсли;

		Блоки = Блоки + СтрШаблон(
			"<details class='dayerr'><summary>%1 - %2</summary>%3</details>",
			Формат(ДеньДанные.Период, "ДФ=yyyy-MM-dd"),
			Формат(ДеньДанные.Всего, "ЧГ=0"),
			Карточки);
	КонецЦикла;

	Если ПустаяСтрока(Блоки) Тогда
		Возврат "";
	КонецЕсли;

	Возврат СтрШаблон("<h3>Ошибки за период</h3>%1", Блоки);

КонецФункции

// Экранирование HTML через тестированный общий шов.
Функция Экранировать(Знач Текст)
	Возврат КИИ_МаркдаунПарсерКлиентСервер.ЭкранироватьHTML(Строка(Текст));
КонецФункции

// Экранирует и переводит переносы строк в разрывы HTML.
Функция ЭкранироватьСПереносами(Знач Текст)
	Возврат СтрЗаменить(Экранировать(Текст), Символы.ПС, "<br>");
КонецФункции

// Усечение длинного текста с многоточием (тексты ошибок и советы ИИ).
Функция СократитьТекст(Знач Текст, Знач МаксДлина)
	Текст = Строка(Текст);
	Если СтрДлина(Текст) <= МаксДлина Тогда
		Возврат Текст;
	КонецЕсли;
	Возврат Лев(Текст, МаксДлина) + "...";
КонецФункции

// Максимум карточек ошибок на день (хвост уходит в счетчик "еще").
Функция ЛимитОшибокДня()
	Возврат 20;
КонецФункции

// Свертывает выборку запроса (Период, Критичность, Количество) в массив по дням.
Функция СвернутьВыборкуВДни(Выборка)

	ПоДням = Новый Соответствие;
	ПорядокПериодов = Новый Массив;

	Пока Выборка.Следующий() Цикл
		ДеньДанные = ПоДням.Получить(Выборка.Период);
		Если ДеньДанные = Неопределено Тогда
			ДеньДанные = Новый Структура("Период, Всего, Уровни", Выборка.Период, 0, Новый Соответствие);
			ПоДням.Вставить(Выборка.Период, ДеньДанные);
			ПорядокПериодов.Добавить(Выборка.Период);
		КонецЕсли;

		ИмяУровня = ИмяУровняКритичности(Выборка.Критичность);
		Накоплено = ДеньДанные.Уровни.Получить(ИмяУровня);
		ДеньДанные.Уровни.Вставить(ИмяУровня, ?(Накоплено = Неопределено, 0, Накоплено) + Выборка.Количество);
		ДеньДанные.Всего = ДеньДанные.Всего + Выборка.Количество;
	КонецЦикла;

	Результат = Новый Массив;
	Для Каждого Период Из ПорядокПериодов Цикл
		Результат.Добавить(ПоДням.Получить(Период));
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Представление уровня критичности строкой; Неопределено -> "Без критичности".
Функция ИмяУровняКритичности(Знач Критичность)
	Если Критичность = Неопределено Тогда
		Возврат "Без критичности";
	КонецЕсли;
	Возврат Строка(Критичность);
КонецФункции

// Порядок уровней от низкого к критическому (плюс "Без критичности" в конце).
Функция ПорядокУровней()
	Порядок = Новый Массив;
	Порядок.Добавить(Строка(Перечисления.КИИ_УровниКритичности.Низкая));
	Порядок.Добавить(Строка(Перечисления.КИИ_УровниКритичности.Средняя));
	Порядок.Добавить(Строка(Перечисления.КИИ_УровниКритичности.Высокая));
	Порядок.Добавить(Строка(Перечисления.КИИ_УровниКритичности.Критическая));
	Порядок.Добавить("Без критичности");
	Возврат Порядок;
КонецФункции

// Цвет сегмента бара по имени уровня критичности.
Функция ЦветУровня(Знач ИмяУровня)
	Цвета = Новый Соответствие;
	Цвета.Вставить(Строка(Перечисления.КИИ_УровниКритичности.Низкая), "#2ecc71");
	Цвета.Вставить(Строка(Перечисления.КИИ_УровниКритичности.Средняя), "#f1c40f");
	Цвета.Вставить(Строка(Перечисления.КИИ_УровниКритичности.Высокая), "#e67e22");
	Цвета.Вставить(Строка(Перечисления.КИИ_УровниКритичности.Критическая), "#e74c3c");
	Цвет = Цвета.Получить(ИмяУровня);
	Возврат ?(Цвет = Неопределено, "#7f8c8d", Цвет);
КонецФункции

// HTML легенды уровней критичности.
Функция ЛегендаHTML()
	Порядок = ПорядокУровней();
	Результат = "";
	Для Каждого ИмяУровня Из Порядок Цикл
		Результат = Результат + СтрШаблон(
			"<span><span class='chip' style='background:%1'></span>%2</span>",
			ЦветУровня(ИмяУровня), ИмяУровня);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Шаблон HTML-страницы (светлая тема): %1 - легенда, %2 - строки дней, %3 - секция ошибок.
Функция ШаблонСтраницы()
	Возврат
	"<html><head><meta charset='utf-8'><style>
	|body{font-family:'Segoe UI',system-ui,Arial,sans-serif;
	|background:#f7f8fa;color:#1f2430;margin:12px;line-height:1.4}
	|h2{margin:0 0 4px;font-size:16px}
	|h3{margin:18px 0 8px;font-size:14px}
	|.sub{color:#6b7280;font-size:12px;margin-bottom:12px}
	|.row{display:flex;align-items:center;margin:5px 0}
	|.day{width:88px;font-size:12px;color:#6b7280}
	|.bar{flex:1;display:flex;height:20px;border-radius:3px;overflow:hidden;background:#e9edf2}
	|.seg{height:100%%}
	|.total{width:44px;text-align:right;font-size:12px;color:#4b5563}
	|.empty{color:#6b7280;font-size:13px;padding:20px 0}
	|.legend{margin-top:14px;font-size:12px;color:#4b5563}
	|.legend>span{margin-right:14px}
	|.chip{display:inline-block;width:10px;height:10px;border-radius:2px;margin-right:5px;vertical-align:middle}
	|.dayerr{margin:6px 0;background:#ffffff;border:1px solid #e5e7eb;border-radius:6px;padding:6px 10px}
	|.dayerr>summary{cursor:pointer;font-size:13px}
	|.err{border-top:1px solid #eef1f4;padding:8px 0}
	|.errhead{font-size:13px}
	|.errcount{color:#6b7280;font-size:12px;margin-left:8px}
	|.errtext{font-family:'Cascadia Mono',Consolas,monospace;font-size:12px;
	|line-height:1.45;color:#374151;margin:4px 0;
	|white-space:pre-wrap;word-break:break-word}
	|.ai{margin-top:4px}
	|.ai>summary{cursor:pointer;font-size:12px;color:#2563eb}
	|.aitext{font-size:12px;line-height:1.5;background:#f0f6ff;border-radius:4px;padding:6px 8px;margin-top:4px}
	|.more{font-size:12px;color:#6b7280;padding:6px 0}
	|</style></head><body>
	|<h2>Ошибки по дням</h2>
	|<div class='sub'>Критичность живая из Журнала (star-схема)</div>
	|%2
	|<div class='legend'>%1</div>
	|%3
	|</body></html>";
КонецФункции

#КонецОбласти

#КонецЕсли
